How to Create Python Pandas DataFrame

In [1]:
import pandas as pd

In [2]:
emt_df = pd.DataFrame()
print(emt_df)

Empty DataFrame
Columns: []
Index: []

In [3]:
list = ['a','b','c']
print(list)

['a', 'b', 'c']

In [5]:
df1 = pd.DataFrame(list)
print(df1)

   0
0  a
1  b
2  c

In [6]:
df1

   0
0  a
1  b
2  c

In [9]:
list_of_list = [[1,2,3], [4,5,6],[7,8,9]]
print(list_of_list)

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [10]:
df2 = pd.DataFrame(list_of_list)
df2

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [11]:
dict1 = {'ID':[11, 23,45,12]}
dict1

{'ID': [11, 23, 45, 12]}

In [12]:
df3 = pd.DataFrame(dict1)
df3

   ID
0  11
1  23
2  45
3  12

In [13]:
dict2 = {'ID':[11, 23,45,12], 'SN':[1,23,43,12]}
dict2

{'ID': [11, 23, 45, 12], 'SN': [1, 23, 43, 12]}

In [14]:
df4 = pd.DataFrame(dict2)
df4

   ID  SN
0  11   1
1  23  23
2  45  43
3  12  12

In [15]:
ls_dict = [{'a':1, 'b': 2}, {'a':3,'b':4} ]
df5 = pd.DataFrame(ls_dict)
df5

   a  b
0  1  2
1  3  4

In [16]:
ls_dict = [{'a':1, 'b': 2}, {'a':3,'b':4,'c':4} ]
df6 = pd.DataFrame(ls_dict)
df6

   a  b    c
0  1  2  NaN
1  3  4  4.0

In [19]:
dict_sr = {'id': pd.Series([1,2,3]), 'sn': pd.Series([11,12,13])}
df7 = pd.DataFrame(dict_sr)
df7

   id  sn
0   1  11
1   2  12
2   3  13